cf_billing/Documents/энргИзменитьПлательщикаУслуги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьПлательщикаУслуги</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргПлательщикиУслугАбонента</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСоставнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПлательщикиСоставныхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьСоставнойУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПлательщикДо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/энргАктивностьТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАктивностьТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргУслугиТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргУслугиТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Техническая</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПоставщикиУслугАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПоставщикиУслугАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьАбонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргПлательщикиУслугАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргПлательщикиУслугАбонента</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСоставной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Documents/энргИзменитьПлательщикаУслуги/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(Объект.Организация) Тогда
			Если не ЗначениеЗаполнено(Объект.ПериодНачисления) Тогда
				Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПлательщикДо","ПлательщикиСоставныхУслуг");
	
	
	ЗаполнитьДокумент=Ложь; 
	Если Параметры.Свойство("ЗаполнитьДокумент") тогда 
		ЗаполнитьДокумент=Истина;
	КонецЕсли;
	
	Если ЗаполнитьДокумент тогда 
		ЗаполнитьПлательщиковНаСервере();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЕстьОшибкиЗаполнения(ПараметрыЗаписи.РежимЗаписи) Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СобытияЭлементовФормы

&НаКлиенте
Процедура АбонентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Абонент) тогда
		энргПользовательскийВводКлиент.ПриИзмененииАбонента(ЭтаФорма);
	иначе
		Объект.КлючПомещения	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
		ЭтаФорма.Помещение 		= ПредопределенноеЗначение("Справочник.энргПомещения.ПустаяСсылка");
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
	КонецЕсли;
	ЗаполнитьПлательщиковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 		
		ЗаполнитьПериодНачисленияСервер();
	КонецЕсли; 
	
	ЗаполнитьПлательщиковНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СтроениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Строение) Тогда
		энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);		
	Иначе
		ЭтаФорма.Строение 		= ПредопределенноеЗначение("Справочник.энргСтроения.ПустаяСсылка");
		Объект.КлючПомещения 	= ПредопределенноеЗначение("Справочник.энргКлючиПомещений.ПустаяСсылка");
	КонецЕсли;
	Объект.Абонент = энргПользовательскийВводСервер.ПрочитатьАбонентаПомещения(Объект.КлючПомещения,Объект.Район,Объект.Организация,Объект.Дата);
	ЗаполнитьПлательщиковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеПриИзменении(Элемент)
	энргПользовательскийВводКлиент.ПриИзмененииСтроенияПомещения(ЭтаФорма);
	Объект.Абонент = энргПользовательскийВводСервер.ПрочитатьАбонентаПомещения(Объект.КлючПомещения,Объект.Район,Объект.Организация,Объект.Дата);
	ЗаполнитьПлательщиковНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДатаФактическогоСобытияПриИзменении(Элемент)
	
	энргРаботаСПериодомДействияКлиент.ПроверитьКорректностьДатыФактическогоСобытияКлиент(Объект.Организация, Объект.Район, Объект.Дата, Объект.ДатаФактическогоСобытия);
	
КонецПроцедуры

#КонецОбласти

#Область СобытияТЧФормы

&НаКлиенте
Процедура ТочкиУчетаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Возврат;
КонецПроцедуры

#КонецОбласти

#Область СобытияПолейТЧФормы

&НаКлиенте
Процедура ТочкиУчетаПлательщикПослеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если не ТекущиеДанные.ЭтоСоставнаяУслуга тогда
		Возврат
	КонецЕсли;	
	СтандартнаяОбработка 		= Ложь;
	энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"),"ПлательщикиСоставныхУслуг");
	// энргРаботаСПоставщиками }
КонецПроцедуры

&НаКлиенте
Процедура ТочкиУчетаПлательщикАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	// энргРаботаСПоставщиками {
	ИмяТаблицыТочек 						= "ТочкиУчета";
	ТекущиеДанные 							= Элементы[ИмяТаблицыТочек].ТекущиеДанные;;
	Если ТекущиеДанные.ЭтоСоставнаяУслуга Тогда
		СтандартнаяОбработка				= Ложь;
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"),"ПлательщикиСоставныхУслуг");
	Иначе 
		энргРаботаСПоставщикамиКлиент.ПоставщикАвтоПодбор(ЭтаФорма,ТекущиеДанные, Новый Структура("ИмяСвойстваПоставщик,ИмяСвойстваПлательщик","Поставщик", "Плательщик"),"ПлательщикиСоставныхУслуг");
	КонецЕсли;
	// энргРаботаСПоставщиками } 
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПлательщиковНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргАктивностьТочекУчетаСрезПоследних.КлючПомещения КАК КлючПомещения,
		|	энргАктивностьТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета
		|ПОМЕСТИТЬ ВТ_АктивныеТУ
		|ИЗ
		|	РегистрСведений.энргАктивностьТочекУчета.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И КлючПомещения = &КлючПомещения) КАК энргАктивностьТочекУчетаСрезПоследних
		|ГДЕ
		|	энргАктивностьТочекУчетаСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_АктивныеТУ.КлючПомещения КАК КлючПомещения,
		|	ВТ_АктивныеТУ.ТочкаУчета КАК ТочкаУчета,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга КАК Услуга,
		|	ВЫБОР
		|		КОГДА энргУслугиТочекУчетаСрезПоследних.Услуга.СоставнаяУслуга
		|			ТОГДА энргВидыУслугСоставляющиеУслуг.Услуга
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)
		|	КОНЕЦ КАК ЧастьСоставнойУслуги,
		|	энргУслугиТочекУчетаСрезПоследних.Услуга.СоставнаяУслуга КАК ЭтоСоставнаяУслуга
		|ПОМЕСТИТЬ ВТ_УслугиТУ
		|ИЗ
		|	ВТ_АктивныеТУ КАК ВТ_АктивныеТУ
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргУслугиТочекУчета.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения = &КлючПомещения) КАК энргУслугиТочекУчетаСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргВидыУслуг.СоставляющиеУслуг КАК энргВидыУслугСоставляющиеУслуг
		|			ПО энргУслугиТочекУчетаСрезПоследних.Услуга = энргВидыУслугСоставляющиеУслуг.Ссылка
		|		ПО ВТ_АктивныеТУ.КлючПомещения = энргУслугиТочекУчетаСрезПоследних.КлючПомещения
		|			И ВТ_АктивныеТУ.ТочкаУчета = энргУслугиТочекУчетаСрезПоследних.ТочкаУчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_УслугиТУ.ТочкаУчета КАК ТочкаУчета,
		|	ВТ_УслугиТУ.Услуга КАК Услуга,
		|	ВТ_УслугиТУ.ЧастьСоставнойУслуги КАК ЧастьСоставнойУслуги,
		|	ВТ_УслугиТУ.ЭтоСоставнаяУслуга КАК ЭтоСоставнаяУслуга,
		|	ЕСТЬNULL(энргПлательщикиУслугАбонентаСрезПоследних.Плательщик, ЗНАЧЕНИЕ(Справочник.энргАбоненты.ПустаяСсылка)) КАК ПлательщикДо,
		|	энргПоставщикиУслугАбонентаСрезПоследних.Поставщик КАК Поставщик
		|ИЗ
		|	ВТ_УслугиТУ КАК ВТ_УслугиТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПоставщикиУслугАбонента.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения = &КлючПомещения) КАК энргПоставщикиУслугАбонентаСрезПоследних
		|		ПО ВТ_УслугиТУ.КлючПомещения = энргПоставщикиУслугАбонентаСрезПоследних.КлючПомещения
		|			И ВТ_УслугиТУ.ТочкаУчета = энргПоставщикиУслугАбонентаСрезПоследних.ТочкаУчета
		|			И (ВЫБОР
		|				КОГДА ВТ_УслугиТУ.ЭтоСоставнаяУслуга
		|					ТОГДА ВТ_УслугиТУ.ЧастьСоставнойУслуги = энргПоставщикиУслугАбонентаСрезПоследних.Услуга
		|				ИНАЧЕ ВТ_УслугиТУ.Услуга = энргПоставщикиУслугАбонентаСрезПоследних.Услуга
		|			КОНЕЦ)
		|			И ВТ_УслугиТУ.ЭтоСоставнаяУслуга = энргПоставщикиУслугАбонентаСрезПоследних.ЧастьСоставной
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.энргПлательщикиУслугАбонента.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Район = &Район
		|					И КлючПомещения = &КлючПомещения) КАК энргПлательщикиУслугАбонентаСрезПоследних
		|		ПО ВТ_УслугиТУ.КлючПомещения = энргПлательщикиУслугАбонентаСрезПоследних.КлючПомещения
		|			И ВТ_УслугиТУ.ТочкаУчета = энргПлательщикиУслугАбонентаСрезПоследних.ТочкаУчета
		|			И (ВЫБОР
		|				КОГДА ВТ_УслугиТУ.ЭтоСоставнаяУслуга
		|					ТОГДА ВТ_УслугиТУ.ЧастьСоставнойУслуги = энргПлательщикиУслугАбонентаСрезПоследних.Услуга
		|				ИНАЧЕ ВТ_УслугиТУ.Услуга = энргПлательщикиУслугАбонентаСрезПоследних.Услуга
		|			КОНЕЦ)
		|			И ВТ_УслугиТУ.ЭтоСоставнаяУслуга = энргПлательщикиУслугАбонентаСрезПоследних.ЧастьСоставной
		|ИТОГИ
		|	МАКСИМУМ(ЭтоСоставнаяУслуга)
		|ПО
		|	ТочкаУчета,
		|	Услуга";
	Если ЗначениеЗаполнено(Объект.ДатаФактическогоСобытия) Тогда
		Запрос.УстановитьПараметр("Период", Объект.ДатаФактическогоСобытия);
	Иначе
		Запрос.УстановитьПараметр("Период", Объект.Дата);
	КонецЕсли;
	Запрос.УстановитьПараметр("Абонент", Объект.Абонент);
	Запрос.УстановитьПараметр("КлючПомещения", Объект.КлючПомещения);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Район", Объект.Район);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Объект.ТочкиУчета.Очистить();
	Объект.ПлательщикиСоставныхУслуг.Очистить();
	Пока Выборка.Следующий() Цикл
		ВыборкаТУ = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТУ.Следующий() Цикл
			СтрокаТЧПлательщики = Объект.ТочкиУчета.Добавить();
			СтрокаТЧПлательщики.IDСтроки = Новый УникальныйИдентификатор;
			ЗаполнитьЗначенияСвойств(СтрокаТЧПлательщики, ВыборкаТУ);
			ВыборкаСоставныхУслуг = ВыборкаТУ.Выбрать();
			Пока ВыборкаСоставныхУслуг.Следующий() Цикл
				Если ВыборкаСоставныхУслуг.ЭтоСоставнаяУслуга Тогда
					СтрокаТЧПлательщикиСоставныхУслуг = Объект.ПлательщикиСоставныхУслуг.Добавить();
					СтрокаТЧПлательщикиСоставныхУслуг.IDСтроки = СтрокаТЧПлательщики.IDСтроки;
					ЗаполнитьЗначенияСвойств(СтрокаТЧПлательщикиСоставныхУслуг, ВыборкаСоставныхУслуг);
				Иначе
					ЗаполнитьЗначенияСвойств(СтрокаТЧПлательщики, ВыборкаСоставныхУслуг, "ПлательщикДо, Поставщик");
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
	КонецЦикла;
	энргРаботаСПоставщикамиСервер.ПриСозданииФормыНаСервере(ЭтаФорма,"ПлательщикДо","ПлательщикиСоставныхУслуг");
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПериодНачисленияСервер()
	Объект.ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Объект.Дата, Объект.Организация,Объект.Район);	
КонецПроцедуры

// энргРаботаСПоставщиками {
&НаКлиенте
Процедура УстановитьУсловноеОФормлениеФормыКлиент(ИмяСвойства=Неопределено, ИмяРеквизитаФормы="ПараметрыПоставщиков") Экспорт  
	УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства,ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

// энргРаботаСПоставщиками {
&НаСервере
Процедура УстановитьУсловноеОФормлениеФормыСервер(ИмяСвойства, ИмяРеквизитаФормы="ПараметрыПоставщиков")
	энргРаботаСПоставщикамиСервер.УстановитьУсловноеОФормлениеФормы(ЭтаФорма,"Плательщик",ИмяРеквизитаФормы);
КонецПроцедуры
// энргРаботаСПоставщиками }

&НаКлиенте
Функция ЕстьОшибкиЗаполнения(РежимЗаписи)
	
	ЕстьОшибкиЗаполнения = Ложь;
		
	Если НачалоМесяца(Объект.Дата) = НачалоМесяца(Объект.ДатаФактическогоСобытия) Тогда
		ЕстьОшибкиЗаполнения = Истина; 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Фактическая и текущая дата не могут находиться в одном периоде");
		Объект.ДатаФактическогоСобытия = Дата(1,1,1);
	КонецЕсли;

	Возврат ЕстьОшибкиЗаполнения;
	
КонецФункции

#КонецОбласти
